#+Title: AWS Cli
#+Subtitle:

* Instalacao
  https://docs.aws.amazon.com/pt_br/cli/latest/userguide/cli-chap-install.html

  Primeiro, confira a versao mais recente do aws-cli em
  https://github.com/aws/aws-cli/releases
  
  No momento da escrita desse texto a verso mais recente era a 1.18.26
  
  
   #+NAME:  pip3 install awscli --upgrade --user                   
   #+BEGIN_SRC shell :session s1 :results output :exports code
      pip3 install awscli --upgrade --user
   #+END_SRC

   #+RESULTS: pip3 install awscli --upgrade --user
   #+begin_example

   Collecting awscli
   [?25l  Downloading https://files.pythonhosted.org/packages/42/ab/4f9932bd4a852f1589e90879a4f9709afb8e191f37f678e4c1c420bfe1c0/awscli-1.18.36-py2.py3-none-any.whl (3.0MB)
   [K     |                                | 10kB 13.8MB/s eta 0:00:01[K     |â                               | 20kB 1.0MB/s eta 0:00:03[K     |â                               | 30kB 1.3MB/s eta 0:00:03[K     |â                               | 40kB 451kB/s eta 0:00:07[K     |â                               | 51kB 540kB/s eta 0:00:06[K     |â                               | 61kB 635kB/s eta 0:00:05[K     |â                               | 71kB 615kB/s eta 0:00:05[K     |â                               | 81kB 661kB/s eta 0:00:05[K     |â                               | 92kB 741kB/s eta 0:00:04[K     |â                               | 102kB 777kB/s eta 0:00:04[K     |ââ                              | 112kB 777kB/s eta 0:00:04[K     |ââ                              | 122kB 777kB/s eta 0:00:04[K     |ââ                              | 133kB 777kB/s eta 0:00:04[K     |ââ                              | 143kB 777kB/s eta 0:00:04[K     |ââ                              | 153kB 777kB/s eta 0:00:04[K     |ââ                              | 163kB 777kB/s eta 0:00:04[K     |ââ                              | 174kB 777kB/s eta 0:00:04[K     |ââ                              | 184kB 777kB/s eta 0:00:04[K     |ââ                              | 194kB 777kB/s eta 0:00:04[K     |âââ                             | 204kB 777kB/s eta 0:00:04[K     |âââ                             | 215kB 777kB/s eta 0:00:04[K     |âââ                             | 225kB 777kB/s eta 0:00:04[K     |âââ                             | 235kB 777kB/s eta 0:00:04[K     |âââ                             | 245kB 777kB/s eta 0:00:04[K     |âââ                             | 256kB 777kB/s eta 0:00:04[K     |âââ                             | 266kB 777kB/s eta 0:00:04[K     |âââ                             | 276kB 777kB/s eta 0:00:04[K     |âââ                             | 286kB 777kB/s eta 0:00:04[K     |ââââ                            | 296kB 777kB/s eta 0:00:04[K     |ââââ                            | 307kB 777kB/s eta 0:00:04[K     |ââââ                            | 317kB 777kB/s eta 0:00:04[K     |ââââ                            | 327kB 777kB/s eta 0:00:04[K     |ââââ                            | 337kB 777kB/s eta 0:00:04[K     |ââââ                            | 348kB 777kB/s eta 0:00:04[K     |ââââ                            | 358kB 777kB/s eta 0:00:04[K     |ââââ                            | 368kB 777kB/s eta 0:00:04[K     |ââââ                            | 378kB 777kB/s eta 0:00:04[K     |âââââ                           | 389kB 777kB/s eta 0:00:04[K     |âââââ                           | 399kB 777kB/s eta 0:00:04[K     |âââââ                           | 409kB 777kB/s eta 0:00:04[K     |âââââ                           | 419kB 777kB/s eta 0:00:04[K     |âââââ                           | 430kB 777kB/s eta 0:00:04[K     |âââââ                           | 440kB 777kB/s eta 0:00:04[K     |âââââ                           | 450kB 777kB/s eta 0:00:04[K     |âââââ                           | 460kB 777kB/s eta 0:00:04[K     |âââââ                           | 471kB 777kB/s eta 0:00:04[K     |ââââââ                          | 481kB 777kB/s eta 0:00:04[K     |ââââââ                          | 491kB 777kB/s eta 0:00:04[K     |ââââââ                          | 501kB 777kB/s eta 0:00:04[K     |ââââââ                          | 512kB 777kB/s eta 0:00:04[K     |ââââââ                          | 522kB 777kB/s eta 0:00:04[K     |ââââââ                          | 532kB 777kB/s eta 0:00:04[K     |ââââââ                          | 542kB 777kB/s eta 0:00:04[K     |ââââââ                          | 552kB 777kB/s eta 0:00:04[K     |ââââââ                          | 563kB 777kB/s eta 0:00:04[K     |âââââââ                         | 573kB 777kB/s eta 0:00:04[K     |âââââââ                         | 583kB 777kB/s eta 0:00:04[K     |âââââââ                         | 593kB 777kB/s eta 0:00:04[K     |âââââââ                         | 604kB 777kB/s eta 0:00:04[K     |âââââââ                         | 614kB 777kB/s eta 0:00:04[K     |âââââââ                         | 624kB 777kB/s eta 0:00:04[K     |âââââââ                         | 634kB 777kB/s eta 0:00:04[K     |âââââââ                         | 645kB 777kB/s eta 0:00:04[K     |âââââââ                         | 655kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 665kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 675kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 686kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 696kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 706kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 716kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 727kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 737kB 777kB/s eta 0:00:03[K     |ââââââââ                        | 747kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 757kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 768kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 778kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 788kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 798kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 808kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 819kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 829kB 777kB/s eta 0:00:03[K     |âââââââââ                       | 839kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 849kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 860kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 870kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 880kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 890kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 901kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 911kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 921kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 931kB 777kB/s eta 0:00:03[K     |ââââââââââ                      | 942kB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 952kB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 962kB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 972kB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 983kB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 993kB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 1.0MB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 1.0MB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 1.0MB 777kB/s eta 0:00:03[K     |âââââââââââ                     | 1.0MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.0MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.1MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.1MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.1MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.1MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.1MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.1MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.1MB 777kB/s eta 0:00:03[K     |ââââââââââââ                    | 1.1MB 777kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.1MB 777kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.1MB 777kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.2MB 777kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.2MB 777kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.2MB 777kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.2MB 777kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.2MB 846kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.2MB 846kB/s eta 0:00:03[K     |âââââââââââââ                   | 1.2MB 846kB/s eta 0:00:03[K     |ââââââââââââââ                  | 1.2MB 846kB/s eta 0:00:03[K     |ââââââââââââââ                  | 1.2MB 846kB/s eta 0:00:03[K     |ââââââââââââââ                  | 1.2MB 846kB/s eta 0:00:03[K     |ââââââââââââââ                  | 1.3MB 846kB/s eta 0:00:03[K     |ââââââââââââââ                  | 1.3MB 846kB/s eta 0:00:03[K     |ââââââââââââââ                  | 1.3MB 846kB/s eta 0:00:03[K     |ââââââââââââââ                  | 1.3MB 846kB/s eta 0:00:03[K     |ââââââââââââââ                  | 1.3MB 846kB/s eta 0:00:02[K     |ââââââââââââââ                  | 1.3MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.3MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.3MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.3MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.4MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.4MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.4MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.4MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.4MB 846kB/s eta 0:00:02[K     |âââââââââââââââ                 | 1.4MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.4MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.4MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.4MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.4MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.5MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.5MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.5MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.5MB 846kB/s eta 0:00:02[K     |ââââââââââââââââ                | 1.5MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.5MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.5MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.5MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.5MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.5MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.6MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.6MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.6MB 846kB/s eta 0:00:02[K     |âââââââââââââââââ               | 1.6MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.6MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.6MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.6MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.6MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.6MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.6MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.7MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.7MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââ              | 1.7MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.7MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.7MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.7MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.7MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.7MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.7MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.8MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.8MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.8MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââ             | 1.8MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.8MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.8MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.8MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.8MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.8MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.8MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.9MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.9MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 1.9MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 1.9MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 1.9MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 1.9MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 1.9MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 1.9MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 1.9MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 1.9MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 2.0MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.0MB 846kB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 2.1MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 2.1MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 2.1MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 2.1MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 2.1MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 2.1MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 2.1MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 2.1MB 846kB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 2.1MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââ         | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââ        | 2.2MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 2.3MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.3MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.4MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.4MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.4MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.4MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.4MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.4MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.4MB 846kB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 2.4MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.4MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.4MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.5MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.5MB 846kB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.5MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.5MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.5MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.5MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 2.5MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.5MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.5MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.5MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.6MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.6MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.6MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.6MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.6MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.6MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 2.6MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.6MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.6MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.7MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.7MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.7MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.7MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.7MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.7MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 2.7MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.7MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.7MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.7MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.8MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.8MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.8MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.8MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.8MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 2.8MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.8MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.8MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.8MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.8MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.9MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.9MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.9MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.9MB 1.5MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 2.9MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 2.9MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 2.9MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 2.9MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 2.9MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 2.9MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 3.0MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 3.0MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 3.0MB 1.5MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 3.0MB 1.5MB/s
   =0.10 in /home/wagner/.local/lib/python3.7/site-packages (from awscli) (0.15.2)
   =3.1.2 in /home/wagner/.local/lib/python3.7/site-packages (from awscli) (3.4.2)
   Collecting botocore==1.15.36 (from awscli)
   [?25l  Downloading https://files.pythonhosted.org/packages/60/f7/f794559d9ffac2e45a56712efa713472032e9861c82629d0183527e2d771/botocore-1.15.36-py2.py3-none-any.whl (6.1MB)
   [K     |                                | 10kB 1.7MB/s eta 0:00:04[K     |                                | 20kB 3.3MB/s eta 0:00:02[K     |â                               | 30kB 785kB/s eta 0:00:08[K     |â                               | 40kB 1.0MB/s eta 0:00:06[K     |â                               | 51kB 1.3MB/s eta 0:00:05[K     |â                               | 61kB 1.5MB/s eta 0:00:04[K     |â                               | 71kB 1.3MB/s eta 0:00:05[K     |â                               | 81kB 1.2MB/s eta 0:00:05[K     |â                               | 92kB 1.4MB/s eta 0:00:05[K     |â                               | 102kB 1.4MB/s eta 0:00:05[K     |â                               | 112kB 1.4MB/s eta 0:00:05[K     |â                               | 122kB 1.4MB/s eta 0:00:05[K     |â                               | 133kB 1.4MB/s eta 0:00:05[K     |â                               | 143kB 1.4MB/s eta 0:00:05[K     |â                               | 153kB 1.4MB/s eta 0:00:05[K     |â                               | 163kB 1.4MB/s eta 0:00:05[K     |â                               | 174kB 1.4MB/s eta 0:00:05[K     |â                               | 184kB 1.4MB/s eta 0:00:05[K     |â                               | 194kB 1.4MB/s eta 0:00:05[K     |â                               | 204kB 1.4MB/s eta 0:00:05[K     |ââ                              | 215kB 1.4MB/s eta 0:00:05[K     |ââ                              | 225kB 1.4MB/s eta 0:00:05[K     |ââ                              | 235kB 1.4MB/s eta 0:00:05[K     |ââ                              | 245kB 1.4MB/s eta 0:00:05[K     |ââ                              | 256kB 1.4MB/s eta 0:00:05[K     |ââ                              | 266kB 1.4MB/s eta 0:00:05[K     |ââ                              | 276kB 1.4MB/s eta 0:00:05[K     |ââ                              | 286kB 1.4MB/s eta 0:00:05[K     |ââ                              | 296kB 1.4MB/s eta 0:00:05[K     |ââ                              | 307kB 1.4MB/s eta 0:00:05[K     |ââ                              | 317kB 1.4MB/s eta 0:00:05[K     |ââ                              | 327kB 1.4MB/s eta 0:00:04[K     |ââ                              | 337kB 1.4MB/s eta 0:00:04[K     |ââ                              | 348kB 1.4MB/s eta 0:00:04[K     |ââ                              | 358kB 1.4MB/s eta 0:00:04[K     |ââ                              | 368kB 1.4MB/s eta 0:00:04[K     |ââ                              | 378kB 1.4MB/s eta 0:00:04[K     |ââ                              | 389kB 1.4MB/s eta 0:00:04[K     |ââ                              | 399kB 1.4MB/s eta 0:00:04[K     |âââ                             | 409kB 1.4MB/s eta 0:00:04[K     |âââ                             | 419kB 1.4MB/s eta 0:00:04[K     |âââ                             | 430kB 1.4MB/s eta 0:00:04[K     |âââ                             | 440kB 1.4MB/s eta 0:00:04[K     |âââ                             | 450kB 1.4MB/s eta 0:00:04[K     |âââ                             | 460kB 1.4MB/s eta 0:00:04[K     |âââ                             | 471kB 1.4MB/s eta 0:00:04[K     |âââ                             | 481kB 1.4MB/s eta 0:00:04[K     |âââ                             | 491kB 1.4MB/s eta 0:00:04[K     |âââ                             | 501kB 1.4MB/s eta 0:00:04[K     |âââ                             | 512kB 1.4MB/s eta 0:00:04[K     |âââ                             | 522kB 1.4MB/s eta 0:00:04[K     |âââ                             | 532kB 1.4MB/s eta 0:00:04[K     |âââ                             | 542kB 1.4MB/s eta 0:00:04[K     |âââ                             | 552kB 1.4MB/s eta 0:00:04[K     |âââ                             | 563kB 1.4MB/s eta 0:00:04[K     |âââ                             | 573kB 1.4MB/s eta 0:00:04[K     |âââ                             | 583kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 593kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 604kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 614kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 624kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 634kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 645kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 655kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 665kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 675kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 686kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 696kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 706kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 716kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 727kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 737kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 747kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 757kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 768kB 1.4MB/s eta 0:00:04[K     |ââââ                            | 778kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 788kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 798kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 808kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 819kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 829kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 839kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 849kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 860kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 870kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 880kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 890kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 901kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 911kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 921kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 931kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 942kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 952kB 1.4MB/s eta 0:00:04[K     |âââââ                           | 962kB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 972kB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 983kB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 993kB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.0MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.0MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.0MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.0MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.0MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.1MB 1.4MB/s eta 0:00:04[K     |ââââââ                          | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.2MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |âââââââ                         | 1.3MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.4MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.5MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.5MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.5MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.5MB 1.4MB/s eta 0:00:04[K     |ââââââââ                        | 1.5MB 1.1MB/s eta 0:00:05[K     |ââââââââ                        | 1.5MB 1.1MB/s eta 0:00:05[K     |ââââââââ                        | 1.5MB 1.1MB/s eta 0:00:05[K     |ââââââââ                        | 1.5MB 1.1MB/s eta 0:00:05[K     |ââââââââ                        | 1.5MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.5MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.6MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.7MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.7MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.7MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.7MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.7MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.7MB 1.1MB/s eta 0:00:05[K     |âââââââââ                       | 1.7MB 1.1MB/s eta 0:00:05[K     |ââââââââââ                      | 1.7MB 1.1MB/s eta 0:00:05[K     |ââââââââââ                      | 1.7MB 1.1MB/s eta 0:00:05[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.8MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.9MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.9MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.9MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.9MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.9MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.9MB 1.1MB/s eta 0:00:04[K     |ââââââââââ                      | 1.9MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 1.9MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 1.9MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 1.9MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.0MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.1MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.1MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.1MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.1MB 1.1MB/s eta 0:00:04[K     |âââââââââââ                     | 2.1MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.1MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.1MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.1MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.1MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.2MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.3MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.3MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.3MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.3MB 1.1MB/s eta 0:00:04[K     |ââââââââââââ                    | 2.3MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.3MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.3MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.3MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.3MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.3MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.4MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.5MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.5MB 1.1MB/s eta 0:00:04[K     |âââââââââââââ                   | 2.5MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.5MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.5MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.5MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.5MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.5MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.5MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.5MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.6MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.7MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.7MB 1.1MB/s eta 0:00:04[K     |ââââââââââââââ                  | 2.7MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.7MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.7MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.7MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.7MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.7MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.7MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.7MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:04[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:03[K     |âââââââââââââââ                 | 2.8MB 1.1MB/s eta 0:00:03[K     |âââââââââââââââ                 | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 2.9MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.0MB 1.4MB/s eta 0:00:03[K     |ââââââââââââââââ                | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.1MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:03[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââ               | 3.2MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.2MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.3MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââ              | 3.4MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.4MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.5MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââ             | 3.6MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.6MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.6MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.6MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.7MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.8MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.8MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.8MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.8MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.8MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââ            | 3.8MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.8MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.8MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.8MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 3.9MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 4.0MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 4.0MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 4.0MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 4.0MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââ           | 4.0MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.0MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.0MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.0MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.0MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.0MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.1MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.2MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.2MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.2MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââ          | 4.2MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.2MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.2MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.2MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.2MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.2MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.2MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.3MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.4MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.4MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââ         | 4.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.4MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.5MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.6MB 1.4MB/s eta 0:00:02[K     |ââââââââââââââââââââââââ        | 4.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââââ       | 4.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââââ       | 4.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââââ       | 4.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââââ       | 4.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââââ       | 4.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââââ       | 4.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââââ       | 4.6MB 1.4MB/s eta 0:00:02[K     |âââââââââââââââââââââââââ       | 4.6MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.7MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââ       | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.8MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââ      | 4.9MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.0MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.1MB 1.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.1MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.1MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.1MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.1MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.1MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.1MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââ     | 5.1MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.1MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.2MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.3MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.3MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.3MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.3MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.3MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.3MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.3MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââ    | 5.3MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.3MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.3MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.4MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.5MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.5MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.5MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.5MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.5MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââ   | 5.5MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.5MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.5MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.5MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.6MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.7MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.7MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.7MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.7MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.7MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââ  | 5.7MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.7MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.7MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.7MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.7MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.8MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.9MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.9MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.9MB 2.4MB/s eta 0:00:01[K     |âââââââââââââââââââââââââââââââ | 5.9MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 5.9MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 5.9MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 5.9MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 5.9MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 5.9MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 5.9MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.0MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.1MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.1MB 2.4MB/s eta 0:00:01[K     |ââââââââââââââââââââââââââââââââ| 6.1MB 2.4MB/s
   =3.10; python_version != "3.4" in /usr/lib64/python3.7/site-packages (from awscli) (5.3.1)
   =0.3.0 in /home/wagner/.local/lib/python3.7/site-packages (from awscli) (0.3.3)
   =0.2.5; python_version != "3.4" in /home/wagner/.local/lib/python3.7/site-packages (from awscli) (0.4.3)
   =0.1.3 in /home/wagner/.local/lib/python3.7/site-packages (from rsa<=3.5.0,>=3.1.2->awscli) (0.4.8)
   =1.20; python_version != "3.4" in /usr/lib/python3.7/site-packages (from botocore==1.15.36->awscli) (1.25.7)
   =0.7.1 in /home/wagner/.local/lib/python3.7/site-packages (from botocore==1.15.36->awscli) (0.9.5)
   =2.1 in /usr/lib/python3.7/site-packages (from botocore==1.15.36->awscli) (2.8.0)
   =1.5 in /usr/lib/python3.7/site-packages (from python-dateutil<3.0.0,>=2.1->botocore==1.15.36->awscli) (1.12.0)
   Installing collected packages: botocore, awscli
     Found existing installation: botocore 1.15.26
       Uninstalling botocore-1.15.26:
         Successfully uninstalled botocore-1.15.26
   Successfully installed awscli-1.18.36 botocore-1.15.36
   #+end_example

   
   #+NAME:  aws --version                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      aws --version
   #+END_SRC

   #+RESULTS: aws --version
   : 
   : aws-cli/1.18.36 Python/3.7.6 Linux/5.5.13-200.fc31.x86_64 botocore/1.15.36


* So atualizando caso ja tenha intalado  
  rode pip3 list  --outdated pra ver se esta desatualizado, se tiver
   pode rodar o comando de instalacao normalmente que atualiza.

   https://pip.pypa.io/en/stable/reference/pip_list/


   #+NAME:  pip3 list -o                   
   #+BEGIN_SRC shell :session s1 :results output :exports code
      #starts code
      pip3 list -o
   #+END_SRC

   #+RESULTS: pip3 list -o
   #+begin_example

   Package         Version  Latest       Type 
   --------------- -------- ------------ -----
   argcomplete     1.10.0   1.11.1       wheel
   argh            0.26.1   0.26.2       wheel
   CairoSVG        1.0.20   2.4.2        wheel
   dbus-python     1.2.8    1.2.16       sdist
   decorator       4.4.0    4.4.2        wheel
   docutils        0.15.2   0.16         wheel
   humanize        0.5.1    2.1.0        wheel
   idna            2.8      2.9          wheel
   libcomps        0.1.14   0.1.14.post1 sdist
   libvirt-python  5.6.0    6.1.0        sdist
   numpy           1.17.4   1.18.2       wheel
   ordered-set     3.1      3.1.1        sdist
   pexpect         4.7.0    4.8.0        wheel
   pid             2.2.3    3.0.0        wheel
   Pillow          6.2.2    7.0.0        wheel
   pip             19.1.1   20.0.2       wheel
   pycairo         1.18.1   1.19.1       sdist
   pycurl          7.43.0.2 7.43.0.5     sdist
   pyenchant       2.0.0    3.0.1        wheel
   PyGObject       3.34.0   3.36.0       sdist
   pyparsing       2.4.0    2.4.6        wheel
   pyparted        3.11.2   3.11.6       sdist
   PySocks         1.7.0    1.7.1        wheel
   pystray         0.14.3   0.15.0       wheel
   python-augeas   0.5.0    1.1.0        sdist
   python-dateutil 2.8.0    2.8.1        wheel
   pytz            2019.2   2019.3       wheel
   pyudev          0.21.0   0.22.0       sdist
   PyYAML          5.3      5.3.1        sdist
   requests        2.22.0   2.23.0       wheel
   rsa             3.4.2    4.0          wheel
   setuptools      41.6.0   46.0.0       wheel
   six             1.12.0   1.14.0       wheel
   slip            0.6.4    20191113     sdist
   urllib3         1.25.7   1.25.8       wheel
   youtube-dl      2020.3.1 2020.3.8     wheel
   #+end_example


* Configurando AWS CLI   
  https://docs.aws.amazon.com/pt_br/cli/latest/userguide/cli-chap-configure.html

  Antes de utilizar aws cli, que vc acabou de instalar, tem que
  configurar ela pra sua conta.

  Pra fazer a configuracao vc vai digitar o seguinte comando aws
  configure, mas nao digite agora porque ele vai pedir algumas
  informacoes pra vc. Por isso e  melhor vc conseguir as informacoes antes...
  
  Detalhe... se vc nao criou ainda um usuario do IAM pra vc usar, em
  substituicao ao seu usuario raiz, entao pare esse tutorial e faca
  isso, depois volte aqui...
  
  Mas se vc criou, entao vamos la..
  
  #+BEGIN_EXAMPLE
  [wagner@localhost ~]$ aws configure
  AWS Access Key ID [None]: 
  #+END_EXAMPLE

  As informacoes q vc tera que fornecer sao as seguintes...
  #+BEGIN_EXAMPLE
  AWS Access Key ID [None]:
  AWS Secret Access Key [None]: 
  Default region name [None]:
  Default output format [None]: 
  #+END_EXAMPLE

  https://docs.aws.amazon.com/general/latest/gr/aws-sec-cred-types.html

  Vc vai usar suas credencias de modo diferente em relação aos
  diferentes tipos de acesso. Então no console web vc usa usuario e
  senha, mas pra usar apis e cliente, vc usa par de chaves de acesso.

  

  Para "Default region name [None]:" vou usar: us-east-1 e para
  "Default output format [None]:" vou usar text porque acho que e mais
  tranquilo pra usar com bash.

  Apos o termino da configuracao do cliente aws sera criado um
  diretorio com os dados dessa configuracao nos seguintes locais

  Linux e MacOS: ~/.aws/config

  Windows: C:\Users\USERNAME\.aws\config 

  Caso vc tenha configurado o cliente para um usuario do IAM, nao o da
  conta raiz da aws, provavelmente vc queira tambem associar uma IAM
  Role para essa conta em relacao ao ECS. Para isso consulte https://docs.aws.amazon.com/AmazonECS/latest/developerguide/task-iam-roles.html
  
  Se vc tiver atras de um proxy, crie as seguintes variaveis de
  ambiente pro seu cliente aws passar por ele..

  #+BEGIN_EXAMPLE
  $ export HTTP_PROXY=http://username:password@proxy.example.com:1234
  $ export HTTPS_PROXY=http://username:password@proxy.example.com:5678
  #+END_EXAMPLE
  



* Entendendo webservices end points
  https://docs.aws.amazon.com/general/latest/gr/rande.html
  
  Os endpoinst que vc vai usar pra acessar os servicos da amazon sao
  referentes a regiao que vc escolheu pra utilizar.

  A sintaxe do endpoint e a seguinte

  protocol://service-code.region-code.amazonaws.com
  
  Como a gente escolheu a regiao us-east-1, pra acessar o servico de
  banco de dados dynamodb, a url do endpoint seria:

  #+BEGIN_EXAMPLE
  https://dynamodb.us-east-1.amazonaws.com
  #+END_EXAMPLE
  
  Para procurar por webservices e acessar a pagina da aws de cada um
  deles, para verificar quais sao suportados em relacao aos servicos da aws
  Sobre endpoints, bem como sua documentacao e qhotas, acesse a seguinte
  url https://docs.aws.amazon.com/general/latest/gr/aws-service-information.html

  Se vc estiver usando java, pra checar programaticamente dos servicos
  em relacao a regiao escolhida consulte esta url https://docs.aws.amazon.com/sdk-for-java/v2/developer-guide/java-dg-region-selection.html#region-selection-query-service


  
* A questao dos --profiles  
  Daria pra criar varias configuracoes de acesso
  A que a gente criou foi o Default

  Caso queira usar outro profile é só fazer conforme oriente o site da
  aws

  #+BEGIN_EXAMPLE
  #https://docs.aws.amazon.com/pt_br/cli/latest/userguide/cli-chap-configure.html
  $ aws configure --profile produser
  AWS Access Key ID [None]: AKIAI44QH8DHBEXAMPLE
  AWS Secret Access Key [None]: je7MtGbClwBF/2Zp9Utk/h3yCo8nvbEXAMPLEKEY
  Default region name [None]: us-east-1
  Default output format [None]: text
  aws s3 ls --profile produser
  #+END_EXAMPLE

  
* continuando
  
   #+NAME:  aws s3 ls                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      aws s3 ls
   #+END_SRC

   #+RESULTS: aws s3 ls
   : 
   : An error occurred (NotSignedUp) when calling the ListBuckets operation: Your account is not signed up for the S3 service. You must sign up before you can use S3.


* confirmacao da conta por email
  https://console.aws.amazon.com/organizations/home#/accounts?context=2432252BF60B64742C6513C7E00CF77180655225244E87570A80C2B85391AE8B
  
  Eu tinha tomado esse erro, 

  "An error occurred (NotSignedUp) when calling the ListBuckets
  operation: Your account is not signed up for the S3 service. You
  must sign up before you can use S3"

  Entrei no site da aws criei uma organizacao
  
  Apos confirmar por email a conta, criei uma organizacao e o erro
  sumiu, mas nao teve nenhuma saida...

   #+NAME:                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      aws s3 ls
   #+END_SRC

   #+RESULTS: 
  

* Criando um bucket
  Se vc tomou esse erro ao usar aws s3 ls


  Então siga a documentação nessa url
  https://docs.aws.amazon.com/pt_br/AmazonS3/latest/gsg/CreatingABucket.html,
  conforme vamos fazer abaixo

  Entre em

  https://docs.aws.amazon.com/pt_br/AmazonS3/latest/gsg/CreatingABucket.html
  
  https://console.aws.amazon.com/s3/home?region=us-east-1
  
  Qdo criar o bucket pode bloquear todos os acessos públicos
  
  Depois consulte abaixo como dar acessos 

  https://docs.aws.amazon.com/pt_br/AmazonS3/latest/user-guide/block-public-access.html

  
  
  


* refs
  https://www.thegeekstuff.com/2019/03/aws-configure-examples/
  https://www.thegeekstuff.com/2019/04/aws-s3-cli-examples/
  https://docs.aws.amazon.com/pt_br/cli/latest/index.html
